{
    "Error creating device": "Gwall wrth greu dyfais",
    "Devices Help": "Cymorth Dyfeisiau",
    "Devices Location": "Lleoliad Dyfeisiau",
    "No devices": "Dim dyfeisiau",
    "Devices are used to configure and prepare the communication with different physical devices. Devices are grouped by Location for easy tracking when deploying at scale.": "Defnyddir dyfeisiau i ffurfweddu a pharatoi'r cyfathrebu â dyfeisiau ffisegol gwahanol. Mae dyfeisiau wedi'u grwpio yn ôl Lleoliad ar gyfer tracio hawdd wrth eu defnyddio ar raddfa.",
    "A device configures and prepares inputs, feeds and other possible settings. e.g. representing different registers of defined metering units.": "Mae dyfais yn ffurfweddu ac yn paratoi mewnbynnau, ffrwdiau a gosodiadau posibl eraill. e.e. yn cynrychioli cofrestrau gwahanol o unedau mesur diffiniedig.",
    "Follow the next link as a guide for generating your request: ": "Dilynwch y ddolen nesaf fel canllaw ar gyfer cynhyrchu eich cais: ",
    "Device API helper": "Cynorthwyydd API Dyfais",
    "New device": "Dyfais newydd",
    "Updated": "Diweddarwyd",
    "Node": "Nod",
    "Name": "Enw",
    "Location": "Lleoliad",
    "Type": "Math",
    "Device access key": "Allwedd mynediad dyfais",
    "tbd": "i'w bennu",
    "Configure Device": "Ffurfweddu Dyfais",
    "Devices": "Dyfeisiau",
    "Please select the correct device template to setup your device:": "Dewiswch y templed dyfais cywir i osod eich dyfais:",
    "Configuration": "Ffurfweddiad",
    "Device Key": "Allwedd Dyfais",
    "New": "Newydd",
    "Generate template from existing inputs, input processing and feeds": "Cynhyrchu templed o fewnbynnau, prosesu mewnbwn a ffrwdiau presennol",
    "Apply custom template": "Cymhwyso templed arferedig",
    "Generated template will be shown here": "Bydd y templed a gynhyrchwyd yn cael ei ddangos yma",
    "Cancel": "Canslo",
    "Delete": "Dileu",
    "Initialize": "Cychwyn",
    "Save": "Cadw",
    "Initialize device": "Cychwyn dyfais",
    "Initializing a device will automaticaly configure inputs and associated feeds as described.": "Bydd cychwyn dyfais yn ffurfweddu mewnbynnau a ffrwdiau cysylltiedig fel y'u disgrifir yn awtomatig.",
    "Warning: ": "Rhybudd: ",
    "Process lists with dependencies to deselected feeds or inputs will be skipped as a whole": "Bydd rhestrau proses â dibyniaethau i ffrwdiau neu fewnbynnau a ddad-ddewiswyd yn cael eu sgipio yn gyfan gwbl",
    "Feeds": "Ffrwdiau",
    "Tag": "Tag",
    "Process list": "Rhestr broses",
    "Inputs": "Mewnbynnau",
    "Key": "Allwedd",
    "Delete device": "Dileu dyfais",
    "Deleting a device is permanent.": "Mae dileu dyfais yn barhaol.",
    "If this device is active and is using a device key, it will no longer be able to post data.": "Os yw'r ddyfais hon yn weithredol ac yn defnyddio allwedd dyfais, ni fydd yn gallu postio data mwyach.",
    "Inputs and Feeds that this device uses are not deleted and all historic data is kept. To remove them, delete them manualy afterwards.": "Nid yw Mewnbynnau a Ffrwdiau y mae'r ddyfais hon yn eu defnyddio yn cael eu dileu ac mae'r holl ddata hanesyddol yn cael ei gadw. I'w tynnu, dilëwch nhw â llaw wedyn.",
    "Are you sure you want to delete?": "Ydych chi'n siŵr eich bod am ddileu?",
    "Delete permanently": "Dileu'n barhaol",
    "Device API": "API Dyfais",
    "Apikey authentication": "Dilysu allwedd API",
    "If you want to call any of the following actions when your not logged in you have this options to authenticate with the API key:": "Os ydych eisiau galw unrhyw un o'r gweithredoedd canlynol pan nad ydych wedi mewngofnodi mae gennych yr opsiynau hyn i ddilysu â'r allwedd API:",
    "Append on the URL of your request: &apikey=APIKEY": "Ychwanegu at URL eich cais: &apikey=APIKEY",
    "Use POST parameter: \"apikey=APIKEY\"": "Defnyddio paramedr POST: \"apikey=APIKEY\"",
    "Add the HTTP header: \"Authorization: Bearer APIKEY\"": "Ychwanegu'r pennyn HTTP: \"Authorization: Bearer APIKEY\"",
    "Read only:": "Darllen yn unig:",
    "Read & Write:": "Darllen ac Ysgrifennu:",
    "Devicekey authentication": "Dilysu allwedd dyfais",
    "Using a device key will only allow sending data for the Node of that device, giving a greater level of security.": "Bydd defnyddio allwedd dyfais dim ond yn caniatáu anfon data ar gyfer Nod y ddyfais honno, gan roi lefel uwch o ddiogelwch.",
    "The input module can use a devicekey instead of an apikey. If you want to authenticate as a device, just replace apikey=APIKEY with devicekey=DEVICEKEY:": "Gall y modiwl mewnbwn ddefnyddio allwedd dyfais yn lle allwedd API. Os ydych eisiau dilysu fel dyfais, dim ond amnewid apikey=APIKEY â devicekey=DEVICEKEY:",
    "Append on the input URL of your request: &devicekey=DEVICEKEY": "Ychwanegu at URL mewnbwn eich cais: &devicekey=DEVICEKEY",
    "Use POST parameter while calling input: \"devicekey=DEVICEKEY\"": "Defnyddio paramedr POST wrth alw mewnbwn: \"devicekey=DEVICEKEY\"",
    "Ensure that the sent input Node matches the Node that is configured for the device on the device menu.": "Sicrhewch fod y Nod mewnbwn a anfonwyd yn cyfateb i'r Nod sydd wedi'i ffurfweddu ar gyfer y ddyfais ar y ddewislen dyfais.",
    "Available HTML URLs": "URLau HTML sydd ar gael",
    "The device list view": "Golwg rhestr dyfeisiau",
    "This page": "Y dudalen hon",
    "Available JSON commands": "Gorchmynion JSON sydd ar gael",
    "To use the json api the request url needs to include <b>.json<\/b>": "I ddefnyddio'r api json mae angen i url y cais gynnwys <b>.json<\/b>",
    "Device actions": "Gweithredoedd dyfais",
    "List devices": "Rhestru dyfeisiau",
    "Get device details": "Cael manylion dyfais",
    "Add a device": "Ychwanegu dyfais",
    "Update device": "Diweddaru dyfais",
    "Generate a random device key": "Cynhyrchu allwedd dyfais ar hap",
    "Set a new random device key": "Gosod allwedd dyfais ar hap newydd",
    "Device MQTT authentication": "Dilysu MQTT dyfais",
    "Request authentication": "Cais dilysu",
    "Check authentication request": "Gwirio cais dilysu",
    "Allow authentication request": "Caniatáu cais dilysu",
    "Template actions": "Gweithredoedd templed",
    "List template metadata": "Rhestru metadata templed",
    "List templates": "Rhestru templedi",
    "Reload templates": "Ail-lwytho templedi",
    "Get template details": "Cael manylion templed",
    "Prepare device initialization": "Paratoi cychwyn dyfais",
    "Devices templates documentation": "Dogfennaeth templedi dyfeisiau",
    "Template files are located at <b>'\\Modules\\device\\data\\*.json'<\/b>": "Mae ffeiliau templed wedi'u lleoli yn <b>'\\Modules\\device\\data\\*.json'<\/b>",
    "Each file defines a device type and provides the default inputs and feeds configurations for that device.": "Mae pob ffeil yn diffinio math o ddyfais ac yn darparu'r ffurfweddiadau mewnbynnau a ffrwdiau rhagosodedig ar gyfer y ddyfais honno.",
    "A device should only need to be initialized once on instalation. Initiating a device twice will duplicate its default inputs and feeds.": "Ni ddylai dyfais ond angen ei chychwyn unwaith ar osod. Bydd cychwyn dyfais ddwywaith yn dyblygu ei mewnbynnau a'i ffrwdiau rhagosodedig."
}